package com.atguigu.inner;

/*
 * 类的5大成员：
 * 1、属性：存储的对象的数据
 * 2、代码块：为属性初始化
 * 3、构造器：（1）创建对象（2）为属性初始化
 * 4、方法：实现对象的功能的
 * 5、内部类
 * 
 * 代表一类事物的特征：属性（数据特征）和方法（行为特征）
 * 
 * 1、为什么要有内部类？
 * 当描述一个事物的时候，发现它的内部还有一个完整的结构，那么这个内部的完整结构就用内部类表示。
 * 例如：身体Body 的内部   心脏（Heart）
 * 并且这个内部的结构只为外部的结构服务，脱离外部类，就没有意义了。
 * 
 * 从语法的角度，内部类可以使用外部类的私有成员，操作外部类起来会更方便。
 * 
 * 例如：在集合框架中，很多集合类型中都有内部类
 * 
 * 2、分类
 * 两大类：
 * 根据声明的位置不同，
 * （1）成员内部类：类中方法外
 * （2）局部内部类：方法体中
 * 
 * 再细分：
 * （1）成员内部类
 * 静态成员内部类，简称静态内部类
 * 非静态成员内部类，简称成员内部类
 * （2）局部内部类
 * 有名字：简称局部内部类
 * 匿名：简称匿名内部类
 * 
 * 
 * 变量：
 * （1）成员变量
 * 类变量：静态变量
 * 实例变量：非静态变量
 * （2）局部变量
 * 
 * 
 */
public class TestInner {

}
